import { Component } from '@angular/core';

@Component({
  selector: 'app-history',
  templateUrl: './history.component.html',
  styleUrl: './history.component.scss',
})
export class HistoryComponent {
  items: any[] = [
    {
      url: '../../assets/images/мури 1.png',
      description:
        'Це комплекс оборонних і монастирських споруд XVII століття у Вінниці. Складався з будівель та стін єзуїтського монастиря, єзуїтського костелу, колегіуму та конвікту (гуртожитки), а також домініканського монастиря і домініканського костелу. Будівлі були оточені потужними кріпосними стінами та бойовими вежами. Мури зведені у XVII столітті монахами-єзуїтами, ставши головною оборонною спорудою міста. Пізніше поруч були прибудовані домініканський монастир з костелом.',
    },
  ];

  historyItems: any[] = [
    {
      url: '../../assets/images/do.png',
      description:
        'Великий костел, колегіум і конвікт (гуртожиток) монахи-єзуїти почали зводити в 1610.',
      description2:
        "У 1617 будівлі єзуїтського і домініканського монастирів обнесені оборонним муром з вежами і склали єдину фортецю, за якою закріпилася назва Мури. Внаслідок аварійного стану південна частина оборонної стіни з пов'язаними з нею келіями та іншими будівлями була розібрана в 1870-х.",
      description3:
        'У 1891 обвалилася частина стіни з боку головного фасаду костелу.',
      description4:
        "У 1901 незначна частина приміщень відремонтована. Оновлення споруд монастиря почалося в 1907 у зв'язку з пристосуванням їх під чоловічу гімназію, а в 1911 в монастирі розміщена і жіноча гімназія.",
    },
  ];
}
