import { Component } from '@angular/core';

@Component({
  selector: 'app-architecture',
  templateUrl: './architecture.component.html',
  styleUrl: './architecture.component.scss',
})
export class ArchitectureComponent {
  items: any[] = [
    {
      url: '../../assets/images/architecture/мури 1.webp',
      description:
        'Це комплекс оборонних і монастирських споруд XVII століття у Вінниці. Складався з будівель та стін єзуїтського монастиря, єзуїтського костелу, колегіуму та конвікту (гуртожитки), а також домініканського монастиря і домініканського костелу. Будівлі були оточені потужними кріпосними стінами та бойовими вежами. Мури зведені у XVII столітті монахами-єзуїтами, ставши головною оборонною спорудою міста. Пізніше поруч були прибудовані домініканський монастир з костелом.',
    },
  ];

  historyItems: any[] = [
    {
      url: '../../assets/images/architecture/do.webp',
      description:
        'Великий костел, колегіум і конвікт (гуртожиток) монахи-єзуїти почали зводити в 1610.',
      description2:
        "У 1617 будівлі єзуїтського і домініканського монастирів обнесені оборонним муром з вежами і склали єдину фортецю, за якою закріпилася назва Мури. Внаслідок аварійного стану південна частина оборонної стіни з пов'язаними з нею келіями та іншими будівлями була розібрана в 1870-х.",
      description3:
        'У 1891 обвалилася частина стіни з боку головного фасаду костелу.',
      description4:
        "У 1901 незначна частина приміщень відремонтована. Оновлення споруд монастиря почалося в 1907 у зв'язку з пристосуванням їх під чоловічу гімназію, а в 1911 в монастирі розміщена і жіноча гімназія.",
    },
  ];

  wallItems: any[] = [
    {
      url: '../../assets/images/architecture/man.webp',
      description:
        'Вежі та стіни були побудовані єзуїтами ще до початку будівництва домініканського костелу в 1617 році. Стіни призначалися для захисту від набігів татар і запорожців. Значна частина стін з вежами, які оточували єзуїтський і домініканський монастирі, зруйнована. Збереглася лише кутова південно-західна башта з південною і частиною західної стін. ',
      description2:
        'Башта цегляна, квадратна в плані, з закругленими кутами, одноярусна, на високому цоколі, що розширюється донизу, укріплена контрфорсами, перекрита склепіннями. На сьогодні розробляється науково-проектна документація, спрямована на їх збереження. Стіни складені з цегли, мають численні бійниці. ',
    },
  ];

  sovoiItems: any[] = [
    {
      url: '../../assets/images/architecture/savoy.webp',
      description:
        'Готель «Савой» — будинок у Вінниці на центральній вулиці Соборній, пам`ятка архітектури місцевого значення, один з неофіційних символів та ідентифікаторів міста.',
    },
  ];
}
