import { Component } from '@angular/core';

@Component({
  selector: 'app-institution',
  templateUrl: './institution.component.html',
  styleUrl: './institution.component.scss',
})
export class InstitutionComponent {
  items: any[] = [
    {
      url: 'assets/images/teatr.jpg',
      title:
        'Вінницький обласний академічний музично-драматичний театр ім. Миколи Садовського',
      description:
        'Це один з найстаріших театрів України, заснований у 1910 році. Театр є осередком театрального мистецтва у Вінниці. Будівля театру має архітектуру стилю модерн з елементами класицизму. У театрі регулярно відбуваються вистави національних та зарубіжних драматургів, а також музичні концерти і фестивалі.',
    },
    {
      url: 'assets/images/museum.jpg',
      title: 'Вінницький обласний краєзнавчий музей',
      description:
        "Заснований у 1918 році, краєзнавчий музей є одним із головних культурних центрів Вінниці. У музеї зберігаються унікальні археологічні, етнографічні та історичні колекції, що висвітлюють історію Поділля та Вінницької області. Будівля музею, виконана в неокласичному стилі, є важливою архітектурною пам'яткою на Соборній.",
    },
    {
      url: 'assets/images/library.jpg',
      title:
        'Вінницька обласна універсальна наукова бібліотека імені Валентина Отамановського',
      description:
        'Бібліотека є культурно-освітнім осередком, де зберігається велика кількість наукових, художніх та історичних книг. Тут проводяться літературні вечори, лекції, зустрічі з письменниками та іншими діячами культури. Бібліотека активно працює над поширенням знань та культури серед мешканців міста.',
    },
    {
      url: 'assets/images/cinema.jpg',
      title: 'Кінотеатр ім. Коцюбинського',
      description:
        'Це один з культурних закладів, який може бути знайдений в Україні, особливо у великих містах. Названий на честь відомого українського письменника Михайла Коцюбинського, цей кінотеатр зазвичай показує широкий спектр фільмів, включаючи художні, документальні та артхаусні стрічки.',
    },
    {
      url: 'assets/images/art.jpg',
      title: 'Галерея "Арт-Вінниця"',
      description:
        'Галерея є платформою для виставок сучасного мистецтва, де представлені роботи місцевих та запрошених художників. Тут також проводяться культурні події, включаючи відкриття виставок, лекції та творчі зустрічі.',
    },
  ];
}
