import { Component } from '@angular/core';

@Component({
  selector: 'app-architecture',
  templateUrl: './architecture.component.html',
  styleUrl: './architecture.component.scss',
})
export class ArchitectureComponent {
  items: any[] = [
    {
      url: 'assets/images/maxresdefault.jpg',
      title: 'Спасо-Преображенський кафедральний собор',
      description:
        'Одна з найстаріших будівель на Соборній. Спочатку це був домініканський костел, побудований у 1624 році. Після секуляризації монастирських земель у 1832 році костел був перетворений на православний храм. Зараз це величний собор з класичними рисами барокової архітектури.',
    },
    {
      url: 'assets/images/arka.jpg',
      title: 'Арка в Центральному парку ім. М. Леонтовича',
      description:
        'Арка на вході до парку є одним із символів Вінниці. Вона була зведена в 1950-х роках і відображає архітектурні тенденції радянського класицизму. Вхідна арка стала популярним місцем для прогулянок та фотосесій.',
    },
    {
      url: 'assets/images/vinnytsia_oblrada.jpg',
      title: 'Вінницька обласна рада',
      description:
        'Вінницька обласна рада розташована у центрі міста Вінниця на Соборній вулиці і є адміністративною будівлею, в якій розташовані органи місцевого самоврядування Вінницької області.',
      description2:
        'Будівля, де зараз знаходиться Вінницька обласна рада, має історичну цінність. Це багатоповерховий комплекс, побудований у характерному для 60-70-х років ХХ століття стилі модернізму. Основні риси цієї архітектури включають прості форми, геометричну точність і функціональність.',
      description3:
        'Будівля обласної ради також є місцем проведення важливих політичних подій регіону, таких як сесії ради, громадські слухання та зустрічі з місцевими мешканцями. Окрім адміністративної функції, вона слугує символом місцевого управління та демократії в області.',
      description4:
        'Знакове розташування на Соборній вулиці підкреслює її значущість для міста та області, оскільки ця вулиця є однією з центральних артерій Вінниці, що має історичне та культурне значення.',
    },
    {
      url: 'assets/images/Hotel-France-Vinnytsia-Exterior.jpg',
      title: 'Готель "Франція"',
      description:
        'Історичний готель "Франція", побудований в кінці XIX століття, є чудовим прикладом еклектичної архітектури з елементами французького стилю. Після відновлення будівля знову функціонує як готель і є однією з візитівок Соборної.',
    },
  ];
}
